/**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: stm32_crc.c
**
** 创   建   人: 张进科
**
** 文件创建日期: 2016 年 11 月 04 日
**
** 描        述: 计算CRC

** 日志:
2016.11.04  创建本文件
*********************************************************************************************************/

#include "stm32_crc.h"
#include "stm32f10x_crc.h"

/*******************************************************************************
* 函数名 	: CalcBlockCRC
* 描述   	: 计算CRC
* 输入     	: - pBuffer: 需要被计算的数据 - BufferLength: 需要计算的字节数
* 输出     	: None
* 返回值    : 计算结果
*******************************************************************************/
u32 CalcBlockCRC(u8 pBuffer[], u32 BufferLength)
{
	u32 index = 0;
	
	CRC_ResetDR(); /* 复位CRC */
	for(index = 0; index < BufferLength; index++)
	{
		CRC->DR = pBuffer[index];
	}
	return (CRC->DR);
}
