/**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: beep_door.h
**
** 创   建   人: 张进科
**
** 文件创建日期: 2016 年 09 月 20 日
**
** 描        述: 蜂鸣器、电子锁驱动

** 日志:
2016.09.20  创建本文件
*********************************************************************************************************/

#ifndef _BEEP_DOOR_H_
#define _BEEP_DOOR_H_	 
#include "sys.h"

#define BEEP PAout(0)	//高电平蜂鸣器响
#define DOOR PEout(4)	//低电平开门

void rt_hw_beep_door_init(void);
void open_door(void);
	
#endif
