/**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: pwm.h
**
** 创   建   人: 张进科
**
** 文件创建日期: 2016 年 09 月 29 日
**
** 描        述: 液晶背光PWM驱动

** 日志:
2016.09.08  创建本文件
*********************************************************************************************************/

#ifndef _PWM_H_
#define _PWM_H_

#include "global.h"

extern void rt_hw_lcd_led_init(uint16_t arr,uint16_t psc);
extern void set_lcd_led (uint8_t device, uint16_t permillage);

#endif
